n = int(input())
result = int((n ** 3 - 3 * (n ** 2) + 2 * n) / 6)
print(result, "\n", 3, sep = "")





# 자 구해봅시다
# i           j           k           합
# 1           2           3 ~ n       n - 3 + 1 = n - 2
# 1           3           4 ~ n       n - 4 + 1 = n - 3
# ...
# 1           n - 2       n - 1 ~ n   n - n + 1 + 1 = 2
# 1           n - 1       n ~ n       n - n + 1 = 1
# => 1부터 n - 2까지의 합
# 
# 2           3           4 ~ n       n - 4 + 1 = n - 3
# 2           4           5 ~ n
# ...
# 2           n - 2       n - 1 ~ n
# 2           n - 1       n ~ n       n - n + 1 = 1
# => 1부터 n - 3까지의 합
# 
# ...
# 
# n - 3       n - 2       n - 1 ~ n   n - n + 1 + 1 = 2
# n - 3       n - 1       n ~ n       n - n + 1 = 1
# => 1부터 2까지의 합
# 
# n - 2       n - 1       n ~ n       n - n + 1 = 1
# => 1부터 1까지의 합
#
#
# ==> 결과: 시그마(k는 1부터 n - 2까지) k * (k + 1) / 2 = k^2 / 2 + k / 2
#     = (n ** 3 - 3 * (n ** 2) + 2 * n) / 6